; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-2-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s1)
	(at package2 s0)
	(at package3 s2)
	(at package4 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 31)
	(= (time-to-drive s1 s0) 31)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 53)
	(= (time-to-drive s2 s0) 53)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 28)
	(= (time-to-drive s1 s2) 28)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s1)
	(at truck1 s1)
	(at truck2 s0)
	(at package1 s1)
	(at package2 s1)
	(at package3 s2)
	(at package4 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 3 of 8
2. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 3 of 8
3. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 3 of 8
4. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 3 of 8
5. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 3 of 8
6. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 4 of 8
7. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 8
8. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 530
   goals met: 3 of 8
9. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 8
10. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 530 to 871
   goals met: 4 of 8
11. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 4 of 8
12. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 8
13. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 8
14. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 871 to 1401
   goals met: 6 of 8
15. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 6 of 8
16. (walk driver2 s0 p1-0)
   deleted: (at driver2 s0)
   added: (at driver2 p1-0)
   goals met: 6 of 8
17. (walk driver2 p1-0 s1)
   deleted: (at driver2 p1-0)
   added: (at driver2 s1)
   goals met: 7 of 8
18. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 8
19. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 1401 to 1681
   goals met: 5 of 8
20. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 5 of 8
21. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 5 of 8
22. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 5 of 8
23. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 5 of 8
24. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 8
25. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 6 of 8
26. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 1681 to 1961
   goals met: 7 of 8
27. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 8 of 8
